app/Http/Controllers/Api/BookController.php

    public function index()
    {
        return new BookResourceIndex(Bookable::all());
---
select * from `bookables`